
/*****************************************************************************
*                  版权所有 (C), 1995-2016, 珠海市科荟电器有限公司            
*								 All Rights Reserved                         
*@作    者   : 阳永锋
*@文 件 名   : E5-5.c
*@版 本 号   : 1.0
*@创建日期   : 2016年11月22日
*@功能描述   : 
*****************************************************************************/

/************************************宏定义**********************************/

/***********************************类型定义*********************************/

/***********************************全局变量*********************************/

/*********************************模块全局变量*******************************/

/*********************************局部全局变量*******************************/

/*********************************局部函数声明*******************************/

#include <stdio.h>

int CountDigit( int number, int digit );

int main()
{
    int number, digit;

    scanf("%d %d", &number, &digit);
    printf("Number of digit %d in %d: %d\n", digit, number, CountDigit(number, digit));

    return 0;
}

/*****************************************************************************
* @作    者:peteryang0601
* @函数名:CountDigit
* @功能描述:统计整数中指定数字的个数
* @输入参数:NONE
* @输出参数:NONE
* @返 回 值:NONE
* @备    注:
*****************************************************************************/
int CountDigit( int number, int digit )
{
	int temp = 0;
	int cnt = 0;

	if (number == 0 && digit == 0)
	{
		return 1;
	}
	
	if (number < 0)
	{
		temp = -number;
	}
	else
	{
		temp = number;
	}
	
	while(temp != 0)
	{
		if (temp % 10 == digit) 
		{
			cnt++;
		}
		temp /= 10;
	}
	return cnt;
}

/***************** (C) COPYRIGHT 2016 珠海科荟电器有限公司 *****END OF FILE**/

