
/*****************************************************************************
*                  版权所有 (C), 1995-2016, 珠海市科荟电器有限公司            
*								 All Rights Reserved                         
*@作    者   : 阳永锋
*@文 件 名   : P5-1.c
*@版 本 号   : 1.0
*@创建日期   : 2016年11月14日
*@功能描述   : 
*****************************************************************************/

/************************************宏定义**********************************/

/***********************************类型定义*********************************/

/***********************************全局变量*********************************/

/*********************************模块全局变量*******************************/

/*********************************局部全局变量*******************************/

/*********************************局部函数声明*******************************/

#include <stdio.h>

#define MAXN 10

int even( int n );
int OddSum( int List[], int N );

int main()
{    
    int List[MAXN], N, i;

    scanf("%d", &N);
    printf("Sum of ( ");
    for ( i=0; i<N; i++ ) {
        scanf("%d", &List[i]);
        if ( even(List[i])==0 )
            printf("%d ", List[i]);
    }
    printf(") = %d\n", OddSum(List, N));

    return 0;
}

/*****************************************************************************
* @作    者:peteryang0601
* @函数名:even
* @功能描述:判断输入整数是否为奇数
* @输入参数:n:输入整数
* @输出参数:NONE
* @返 回 值:偶数:1，奇数:0
* @备    注:
*****************************************************************************/
int even( int n )
{
	if (n % 2 == 0)
		return 1;
	else
		return 0;
}

/*****************************************************************************
* @作    者:peteryang0601
* @函数名:OddSum
* @功能描述:计算输入序列数中奇数和
* @输入参数:List:数序列,N:序列大小
* @输出参数:NONE
* @返 回 值:奇数和
* @备    注:
*****************************************************************************/
int OddSum( int List[], int N )
{
	int sum = 0;
	int pos = 0;

	for (pos = 0; pos < N; pos++)
	{
		if (!even(List[pos]))
			sum += List[pos];
	}
	return sum;
}

/***************** (C) COPYRIGHT 2016 珠海科荟电器有限公司 *****END OF FILE**/

