
/*****************************************************************************
*                  版权所有 (C), 1995-2016, 珠海市科荟电器有限公司            
*								 All Rights Reserved                         
*@作    者   : 阳永锋
*@文 件 名   : P5-1.c
*@版 本 号   : 1.0
*@创建日期   : 2016年11月14日
*@功能描述   : 
*****************************************************************************/

/************************************宏定义**********************************/

/***********************************类型定义*********************************/

/***********************************全局变量*********************************/

/*********************************模块全局变量*******************************/

/*********************************局部全局变量*******************************/

/*********************************局部函数声明*******************************/


#include <stdio.h>

void pyramid( int n );

int main()
{    
    int n;

    scanf("%d", &n);
    pyramid(n);

    return 0;
}

/*****************************************************************************
* @作    者:peteryang0601
* @函数名:print_line_indet
* @功能描述:打印行缩进
* @输入参数:cur_line_num:当期行号,max_line_num:打印的最大行号
* @输出参数:NONE
* @返 回 值:NONE
* @备    注:
*****************************************************************************/
void print_line_indet(int cur_line_num,int max_line_num)
{
	int indent = 0;
	int cnt = 0;
	
	indent = max_line_num - cur_line_num;	/*缩进数为打印最大行号减去当前行号*/
	for (cnt = 0; cnt < indent; cnt++)
	{
		printf(" ");
	}
	return;
}

/*****************************************************************************
* @作    者:peteryang0601
* @函数名:print_line
* @功能描述:打印整数金子塔的一行
* @输入参数:cur_line_num:当期行号,max_line_num:打印的最大行号
* @输出参数:NONE
* @返 回 值:NONE
* @备    注:
*****************************************************************************/
void print_line(int cur_line_num,int max_line_num)
{
	int cnt = 0;
	
	print_line_indet(cur_line_num,max_line_num);	/*打印本行缩进*/
	for (cnt = 0; cnt < cur_line_num; cnt++)		/*打印行内容*/
	{
		printf("%1d ",cur_line_num);
	}
	printf("\n");									/*换行*/
	return;
}

/*****************************************************************************
* @作    者:阳永锋
* @函数名:pyramid
* @功能描述:输出整数金字塔
* @输入参数:n:金字塔数
* @输出参数:NONE
* @返 回 值:NONE
* @备    注:
*****************************************************************************/
void pyramid( int n )
{
	int print_num = 1;
	int print_start_pos = 1;

	for (print_num = 1; print_num <= n; print_num++)
	{
		print_line(print_num,n);
	}
	return;
}

/***************** (C) COPYRIGHT 2016 珠海科荟电器有限公司 *****END OF FILE**/

